In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    [
        ['PE', 'Pernambuco', 'Recife'],['PI', 'Piaui', 'Teresina'],
        ['SE', 'Sergipe', 'Aracaju'],['CE', 'Ceará', 'Fortaleza']   
    ], columns=['Sigla', 'Nome', 'Capital']
)

In [4]:
df

  Sigla        Nome    Capital
0    PE  Pernambuco     Recife
1    PI       Piaui   Teresina
2    SE     Sergipe    Aracaju
3    CE       Ceará  Fortaleza

In [5]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
df.iloc[0]

Sigla              PE
Nome       Pernambuco
Capital        Recife
Name: 0, dtype: object

In [11]:
df.loc[:2]

  Sigla        Nome   Capital
0    PE  Pernambuco    Recife
1    PI       Piaui  Teresina
2    SE     Sergipe   Aracaju

In [12]:
df.index = pd.Index([1,2,3,4])

In [13]:
df

  Sigla        Nome    Capital
1    PE  Pernambuco     Recife
2    PI       Piaui   Teresina
3    SE     Sergipe    Aracaju
4    CE       Ceará  Fortaleza

In [14]:
df.index = df['Sigla']

In [16]:
df

      Sigla        Nome    Capital
Sigla
PE       PE  Pernambuco     Recife
PI       PI       Piaui   Teresina
SE       SE     Sergipe    Aracaju
CE       CE       Ceará  Fortaleza

In [17]:
del df['Sigla']

In [18]:
df

             Nome    Capital
Sigla
PE     Pernambuco     Recife
PI          Piaui   Teresina
SE        Sergipe    Aracaju
CE          Ceará  Fortaleza